tommyy94/crispy-winner/BSP/Drivers/Camera/same70_camera.c
/** @defgroup STM32H747I_DISCO_CAMERA_Private_Variables Private Variables
  * @{
  */
static CAMERA_Drv_t *Camera_Drv = NULL;
static CAMERA_Capabilities_t Camera_Cap;
//static uint32_t HSPolarity = DCMI_HSPOLARITY_LOW;
static uint32_t CameraId;
/**
  * @}
  */

/** @defgroup STM32H747I_DISCO_CAMERA_Private_FunctionsPrototypes Private Functions Prototypes
  * @{
  */
static int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat);
static int32_t BSP_CAMERA_ConfigureIO(void);


#if (USE_CAMERA_SENSOR_OV5640 == 1)
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif
/**
  * @}
  */
#define CAMERA_VGA_RES_X          640
#define CAMERA_VGA_RES_Y          480
#define CAMERA_480x272_RES_X      480
#define CAMERA_480x272_RES_Y      272


#define OV5640_RST_PORT   (PIOA)
#define OV5640_PCK_PORT   (PIOA)
#define OV5640_PWD_PORT   (PIOC)
#define OV5640_RST_PIN    (1u << 13)
#define OV5640_PWD_PIN    (1u << 19)
#define OV5640_XCLK_PIN   (1u << 6)


#define BSP_ERROR_NONE                         0
#define BSP_ERROR_NO_INIT                     -1
#define BSP_ERROR_WRONG_PARAM                 -2
#define BSP_ERROR_BUSY                        -3
#define BSP_ERROR_PERIPH_FAILURE              -4
#define BSP_ERROR_COMPONENT_FAILURE           -5
#define BSP_ERROR_UNKNOWN_FAILURE             -6
#define BSP_ERROR_UNKNOWN_COMPONENT           -7
#define BSP_ERROR_BUS_FAILURE                 -8
#define BSP_ERROR_CLOCK_FAILURE               -9
#define BSP_ERROR_MSP_FAILURE                 -10
#define BSP_ERROR_FEATURE_NOT_SUPPORTED       -11

/** @defgroup STM32H747I_DISCO_CAMERA_Exported_Functions Exported Functions
  * @{
  */


/**
 * Configure OV5640 I/O pins.
 *
 * @retval  OV5640_OK
 */
static int32_t BSP_CAMERA_ConfigureIO(void)
{
    IO_ConfigureOutput(OV5640_PWD_PORT, OV5640_PWD_PIN, OV5640_PWD_PIN);
    IO_ConfigureOutput(OV5640_RST_PORT, OV5640_RST_PIN, OV5640_RST_PIN);
    IO_SetPeripheralFunction(OV5640_PCK_PORT, OV5640_XCLK_PIN, IO_PERIPH_B);

    /* Configure the host controller to feed clock input to OV5640
     * MCK (System Clock) = 150 MHz
     * PCK0 = 150MHz / 6 = 25MHz
     */
    PMC_ProgrammableClockInit(0, 5, PCK_SOURCE_MCK_CLK);
    PMC_ProgrammableClockEnable(0);

    return OV5640_OK;
}


/**
  * @brief  Initializes the camera.
  * @param  Instance    Camera instance.
  * @param  Resolution  Camera sensor requested resolution (x, y) : standard resolution
  *         naming QQVGA, QVGA, VGA ...
  * @param  PixelFormat Capture pixel format
  * @retval BSP status
  */
int32_t BSP_CAMERA_Init(uint32_t Instance, uint32_t Resolution, uint32_t PixelFormat)
{

  Resolution_t  res;
  uint32_t      pf;
  uint32_t      pfTbl[] =
  {
      PF_RGB565, PF_RGB888, PF_YUV, PF_GRAYSCALE
  };
  Resolution_t  resTbl[] = 
  {
      { 160, 120 }, /* OV5640_R160x120 */
      { 320, 240 }, /* OV5640_R320x240 */
      { 480, 272 }, /* OV5640_R480x272 */
      { 640, 480 }, /* OV5640_R640x480 */
      { 800, 480 }  /* OV5640_R800x480 */
  };

  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Validity check */
    if (Resolution > OV5640_R800x480)
    {
      res.h = 0xFFFFFFFF;
      res.v = 0xFFFFFFFF;
    }
    else
    {
      res = resTbl[Resolution];
    }

    /* Validity check */
    if (PixelFormat >= PF_UNSUPPORTED)
    {
      pf = PF_UNSUPPORTED;
    }
    else
    {
      pf = pfTbl[PixelFormat];
    }

    ret = ISI_Init(res, pf);
    if (ret != ISI_OK)
    {
        return BSP_ERROR_PERIPH_FAILURE;
    }

    /* ST eval board probably has this deasserted */
    IO_SetOutput(OV5640_RST_PORT, OV5640_RST_PIN);

    if(BSP_CAMERA_HwReset(CAMERA_INSTANCE) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
#if (USE_CAMERA_SENSOR_OV5640 == 1)
      //if(ret != BSP_ERROR_NONE) /* Why? */
      if(ret == BSP_ERROR_NONE)
      {
        ret = OV5640_Probe(Resolution, PixelFormat);
      }
#endif
      if(ret != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_UNKNOWN_COMPONENT;
      }
      else
      {
        //HSPolarity = DCMI_HSPOLARITY_HIGH;
        /* Initialize the camera driver structure */
        //if(MX_DCMI_Init(&hcamera_dcmi) != HAL_OK)
        //{
        //  ret = BSP_ERROR_PERIPH_FAILURE;
        //}

        if(ret == BSP_ERROR_NONE)
        {
          if(BSP_CAMERA_HwReset(CAMERA_INSTANCE) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_BUS_FAILURE;
          }
        }

        if(ret == BSP_ERROR_NONE)
        {
          Camera_Ctx[Instance].CameraId  = CameraId;
        }
        if(ret == BSP_ERROR_NONE)
        {
          Camera_Ctx[Instance].Resolution  = Resolution;
          Camera_Ctx[Instance].PixelFormat = PixelFormat;
        }
      }
    }
  }

  /* BSP status */
  return ret;
}
/**
  * @brief  DeInitializes the camera.
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DeInit(uint32_t Instance)
{
    (void)Instance;
    return 0;
}


/**
  * @brief  Starts the camera capture in continuous mode.
  * @param  Instance Camera instance.
  * @param  pBff     pointer to the camera output buffer
  * @param  Mode CAMERA_MODE_CONTINUOUS or CAMERA_MODE_SNAPSHOT
  * @retval BSP status
  */
int32_t BSP_CAMERA_Start(uint32_t Instance, uint8_t *pBff, uint32_t Mode)
{
    (void)Instance;
    (void)pBff;
    (void)Mode;
    return 0;
}

/**
  * @brief  Stop the CAMERA capture
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_Stop(uint32_t Instance)
{
    (void)Instance;
    return 0;
}

/**
  * @brief Suspend the CAMERA capture
  * @param  Instance Camera instance.
  */
int32_t BSP_CAMERA_Suspend(uint32_t Instance)
{
    (void)Instance;
    return 0;
}

/**
  * @brief Resume the CAMERA capture
  * @param  Instance Camera instance.
  */
int32_t BSP_CAMERA_Resume(uint32_t Instance)
{
    (void)Instance;
    return 0;
}

/**
  * @brief  Get the Camera Capabilities.
  * @param  Instance  Camera instance.
  * @param  Capabilities  pointer to camera Capabilities
  * @note   This function should be called after the init. This to get Capabilities
  *         from the right camera sensor(OV9655)
  * @retval Component status
  */
int32_t BSP_CAMERA_GetCapabilities(uint32_t Instance, CAMERA_Capabilities_t *Capabilities)
{
  int32_t ret;

