tommyy94/crispy-winner/BSP/Drivers/Camera/same70_camera.c
  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(Camera_Cap.Zoom == 0U)
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else
  {
    *Zoom = Camera_Ctx[Instance].Zoom;
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Enable the camera night mode
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_EnableNightMode(uint32_t Instance)
{
  int32_t ret;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(Camera_Cap.NightMode == 0U)
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if(Camera_Drv->NightModeConfig(Camera_CompObj, CAMERA_NIGHT_MODE_SET) < 0)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Disable the camera night mode
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DisableNightMode(uint32_t Instance)
{
  int32_t ret;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(Camera_Cap.NightMode == 0U)
  {
    ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else if(Camera_Drv->NightModeConfig(Camera_CompObj, CAMERA_NIGHT_MODE_RESET) < 0)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  CAMERA hardware reset
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_HwReset(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* De-assert the camera POWER_DOWN pin (active high) */
    IO_SetOutput(OV5640_PWD_PORT, OV5640_PWD_PIN);
    /* POWER_DOWN de-asserted during 100 ms */
    delayMs(100);

    /* Assert the camera POWER_DOWN pin (active high) */
    IO_ClearOutput(OV5640_PWD_PORT, OV5640_PWD_PIN);
    delayMs(20);
  }

  return ret;
}

/**
  * @brief  CAMERA power down
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_PwrDown(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
      /* De-assert the camera POWER_DOWN pin (active high) */
    IO_SetOutput(OV5640_PWD_PORT, OV5640_PWD_PIN);
  }

  return ret;
}

/**
  * @brief  CAMERA power up
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_PwrUp(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Assert the camera POWER_DOWN pin (active high) */
    IO_ClearOutput(OV5640_PWD_PORT, OV5640_PWD_PIN);
  }

  return ret;
}
/**
  * @brief  This function handles DCMI interrupt request.
  * @param  Instance Camera instance
  * @retval None
  */
void BSP_CAMERA_IRQHandler(uint32_t Instance)
{
    (void)Instance;
}

/**
  * @brief  This function handles DCMI DMA interrupt request.
  * @param  Instance Camera instance
  * @retval None
  */
void BSP_CAMERA_DMA_IRQHandler(uint32_t Instance)
{
    (void)Instance;
}

/**
  * @}
  */

/** @defgroup STM32H747I_DISCO_CAMERA_Private_Functions Private Functions
  * @{
  */

/**
  * @brief  Get the capture size in pixels unit.
  * @param  Resolution  the current resolution.
  * @param  PixelFormat Camera pixel format
  * @retval capture size in 32-bit words.
  */
static int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat)
{
  uint32_t size = 0;
  uint32_t pf_div;
  if(PixelFormat == CAMERA_PF_RGB888)
  {
    pf_div = 3; /* each pixel on 3 bytes so 3/4 words */
  }
  else
  {
    pf_div = 2; /* each pixel on 2 bytes so 1/2 words*/
  }
  /* Get capture size */
  switch (Resolution)
  {
  case CAMERA_R160x120:
    size =  ((uint32_t)(160*120)*pf_div)/4U;
    break;
  case CAMERA_R320x240:
    size =  ((uint32_t)(320*240)*pf_div)/4U;
    break;
  case CAMERA_R480x272:
    size =  ((uint32_t)(480*272)*pf_div)/4U;
    break;
  case CAMERA_R640x480:
    size =  ((uint32_t)(640*480)*pf_div)/4U;
    break;
  case CAMERA_R800x480:
    size =  ((uint32_t)(800*480)*pf_div)/4U;
    break;
  default:
    break;
  }

  return (int32_t)size;
}


/**
  * @brief  Line Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
 void BSP_CAMERA_LineEventCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  (void)Instance;

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_LineEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Frame Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
 void BSP_CAMERA_FrameEventCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  (void)Instance;

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_FrameEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Vsync Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
 void BSP_CAMERA_VsyncEventCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  (void)Instance;

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_FrameEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Error callback.
  * @param  Instance Camera instance.
  * @retval None
  */
 void BSP_CAMERA_ErrorCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  (void)Instance;

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_ErrorCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup STM32H747I_DISCO_CAMERA_Private_Functions Private Functions
  * @{
  */

#if (USE_CAMERA_SENSOR_OV5640 == 1)
#include <stdio.h>

/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
    uint32_t          id;
    OV5640_Object_t   ov5640_obj;
    OV5640_IO_t       ov5640_io;

    ov5640_io.Address   = CAMERA_OV5640_ADDRESS; 
    ov5640_io.Init      = BSP_CAMERA_ConfigureIO;
    ov5640_io.DeInit    = OV5640_I2C_Stub;
    ov5640_io.GetTick   = OV5640_I2C_Stub;
    ov5640_io.ReadReg   = OV5640_ReadReg;
    ov5640_io.WriteReg  = OV5640_WriteReg;

    ov5640_obj.IsInitialized = 0U;

    puts("Image_Task  > Initializing camera...");

    if (OV5640_RegisterBusIO(&ov5640_obj, &ov5640_io) != OV5640_OK)
    {
        puts("Image_Task  > OV5640_RegisterBusIO() fail");
        return BSP_ERROR_NO_INIT;
    }

    if (OV5640_ReadID(&ov5640_obj, &id) != OV5640_OK)
    {
        puts("Image_Task  > OV5640_ReadID() fail");
        return BSP_ERROR_NO_INIT;
    }
    
    if (id != OV5640_ID)
    {
        puts("Image_Task  > Invalid camera ID");
        return BSP_ERROR_NO_INIT;
    }
    else
    {
        Camera_Drv = (CAMERA_Drv_t *)&OV5640_CAMERA_Driver;
        Camera_CompObj = &ov5640_obj;
        if(Camera_Drv->Init(Camera_CompObj, Resolution, PixelFormat) != OV5640_OK)
        {
            puts("Image_Task  > Camera_Drv->Init() fail");
            return BSP_ERROR_NO_INIT;
        }
        else if(Camera_Drv->GetCapabilities(Camera_CompObj, &Camera_Cap) != OV5640_OK)
        {
            puts("Image_Task  > Camera_Drv->GetCapabilities() fail");
            return BSP_ERROR_NO_INIT;
        }
        else
        {
            puts("Image_Task  > Camera init success");
        }
    }

  return BSP_ERROR_NONE;
}
#endif


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
